#include "basic.h"

/*******************************************************************************
 函数名称：    void delay(u16 cnt)
 功能描述：    软件延时程序
 操作的表：    无
 输入参数：    cnt 需要延时的时间
 输出参数：    无
 返 回 值：    无
 多任务访问:   该函数涉及全局表项操作，不可重入
 其它说明：
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2015/11/5      V1.0           Howlet Li          创建
 *******************************************************************************/
//__attribute__ ((section("ram_code"))) 


